yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32E51x.xml
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_WP_N[31:24]</name>
        <displayName>OB_WP_N[31:24]</displayName>
        <addressOffset>0xF</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_WP_N[31:24]</name>
                <brief>WP complement value bit 31 to 24</brief>
                <description>WP complement value bit 31 to 24</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
	<OPByte>
        <name>OB_USER1</name>
        <displayName>OB_USER1</displayName>
        <addressOffset>0x10</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>FLASH_ECCEN</name>
                <brief>FLASH_ECCEN</brief>
                <description>0: Disable ECC for Flash&#x000A;1: Enable ECC for Flash</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>SRAM_ECCEN</name>
                <brief>SRAM_ECCEN</brief>
				<description>0: disable SRAM ECC, and SRAM parity checking becomes available&#x000A;1: enable SRAM ECC</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_USER1_N</name>
        <displayName>OB_USER1_N</displayName>
        <addressOffset>0x11</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_USER1_N</name>
                <brief>OB_USER1 complement value</brief>
                <description>OB_USER1 complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    </OPBytes> 
</OPBytesArchitecture>
<OPBytesArchitecture type = "1">
    <OPBytes baseAddress="0x1FFFF800" length="24" RegType="OptionBytes">
    <OPByte>
        <name>OB_SPC</name>
        <displayName>OB_SPC</displayName>
        <addressOffset>0x0</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xA5</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>SPC</name>
                <brief>Option byte security protection value</brief>
                <description>Option byte security protection value&#x000A;0xA5 : no security protection&#x000A;any value except 0xA5 or 0xCC : protection level low&#x000A;0xCC : protection level high</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_SPC_N</name>
        <displayName>OB_SPC_N</displayName>
        <addressOffset>0x1</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x5A</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_SPC_N</name>
                <brief>OB_SPC complement value</brief>
                <description>SPC complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_USER0</name>
        <displayName>OB_USER0</displayName>
        <addressOffset>0x2</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
			<field>
                <name>FMC_SWP</name>
                <brief>FMC_SWP</brief>
                <description>FMC_SWP&#x000A;0: Flash Bank 1 is mapped at 0x0800 0000 (aliased at 0x0000 0000) and Flash Bank 0 is mapped at 0x0804 0000 (aliased at 0x0004 0000)&#x000A;1: Flash Bank 0 is mapped at 0x0800 0000 (aliased at 0x0000 0000) and Flash Bank 1 is mapped at 0x0804 0000 (aliased at 0x0004 0000)</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
		    <field>
                <name>SRAM_PARITY_CHECK</name>
                <brief>Enable SRAM parity check</brief>
                <description>SRAM_PARITY_CHECK&#x000A;0: Enable SRAM parity check&#x000A;1: Disable SRAM parity check</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
		    <field>
                <name>VDDA_VISOR</name>
                <brief>Enable VDDA monitor</brief>
                <description>VDDA_VISOR&#x000A;0: Disable VDDA monitor&#x000A;1: Enable VDDA monitor</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
		    <field>
                <name>BOOT1_n</name>
                <brief>BOOT1 bit</brief>
                <description>BOOT1_n&#x000A;0: BOOT1 bit is 1&#x000A;1: BOOT1 bit is 0</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>nRST_STDBY</name>
                <brief>Generate a reset instead of entering standby mode</brief>
                <description>nRST_STDBY&#x000A;0: generate a reset instead of entering standby mode&#x000A;1: no reset when entering standby mode</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>nRST_DPSLP</name>
                <brief>Generate a reset instead of entering Deep-sleep mode</brief>
                <description>nRST_DPSLP&#x000A;0: generate a reset instead of entering Deep-sleep mode&#x000A;1: no reset when entering Deep-sleep mode</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>nWDG_HW</name>
                <brief>Hardware free watchdog</brief>
                <description>nWDG_HW&#x000A;0: hardware free watchdog&#x000A;1: software free watchdog</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_USER0_N</name>
        <displayName>OB_USER0_N</displayName>
        <addressOffset>0x3</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_USER0_N</name>
                <brief>OB_USER0 complement value</brief>
                <description>OB_USER0 complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_DATA[7:0]</name>
        <displayName>OB_DATA[7:0]</displayName>
        <addressOffset>0x4</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>OB_DATA[7:0]</name>
                <brief>user defined data bit 7 to 0</brief>
                <description>user defined data bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_DATA_N[7:0]</name>
        <displayName>OB_DATA_N[7:0]</displayName>
        <addressOffset>0x5</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_DATA_N[7:0]</name>
                <brief>DATA complement value bit 7 to 0</brief>
                <description>DATA complement value bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_DATA[15:8]</name>
        <displayName>OB_DATA[15:8]</displayName>
        <addressOffset>0x6</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>OB_DATA[15:8]</name>
                <brief>user defined data bit 15 to 8</brief>
                <description>user defined data bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_DATA_N[15:8]</name>
        <displayName>OB_DATA_N[15:8]</displayName>
        <addressOffset>0x7</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_DATA_N[15:8]</name>
                <brief>DATA complement value bit 15 to 8</brief>
                <description>DATA complement value bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_WP[7:0]</name>
        <displayName>OB_WP[7:0]</displayName>
        <addressOffset>0x8</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>OB_WP[7]</name>
                <brief>0x0801C000~0x0801FFFF</brief>
                <description>Page Erase/Program Protection bit 7(0x0801C000~0x0801FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[6]</name>
                <brief>0x08018000~0x0801BFFF</brief>
                <description>Page Erase/Program Protection bit 6(0x08018000~0x0801BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[5]</name>
                <brief>0x08014000~0x08017FFF</brief>
                <description>Page Erase/Program Protection bit 5(0x08014000~0x08017FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[4]</name>
                <brief>0x08010000~0x08013FFF</brief>
                <description>Page Erase/Program Protection bit 4(0x08010000~0x08013FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[3]</name>
                <brief>0x0800C000~0x0800FFFF</brief>
                <description>Page Erase/Program Protection bit 3(0x0800C000~0x0800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[2]</name>
                <brief>0x08008000~0x0800BFFF</brief>
                <description>Page Erase/Program Protection bit 2(0x08008000~0x0800BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[1]</name>
                <brief>0x08004000~0x08007FFF</brief>
                <description>Page Erase/Program Protection bit 1(0x08004000~0x08007FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[0]</name>
                <brief>0x08000000~0x08003FFF</brief>
                <description>Page Erase/Program Protection bit 0(0x08000000~0x08003FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>OB_WP_N[7:0]</name>
        <displayName>OB_WP_N[7:0]</displayName>
        <addressOffset>0x9</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>WP_N[7:0]</name>
                <brief>WP complement value bit 7 to 0</brief>
                <description>WP complement value bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_WP[15:8]</name>
        <displayName>OB_WP[15:8]</displayName>
        <addressOffset>0xA</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>OB_WP[15]</name>
                <brief>0x0803C000~0x0803FFFF</brief>
                <description>Page Erase/Program Protection bit 15(0x0803C000~0x0803FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[14]</name>
                <brief>0x08038000~0x0803BFFF</brief>
                <description>Page Erase/Program Protection bit 14(0x08038000~0x0803BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[13]</name>
                <brief>0x08034000~0x08037FFF</brief>
                <description>Page Erase/Program Protection bit 13(0x08034000~0x08037FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[12]</name>
                <brief>0x08030000~0x08033FFF</brief>
                <description>Page Erase/Program Protection bit 12(0x08030000~0x08033FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[11]</name>
                <brief>0x0802C000~0x0802FFFF</brief>
                <description>Page Erase/Program Protection bit 11(0x0802C000~0x0802FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[10]</name>
                <brief>0x08028000~0x0802BFFF</brief>
                <description>Page Erase/Program Protection bit 10(0x08028000~0x0802BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[9]</name>
                <brief>0x08024000~0x08027FFF</brief>
                <description>Page Erase/Program Protection bit 9(0x08024000~0x08027FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[8]</name>
                <brief>0x08020000~0x08023FFF</brief>
                <description>Page Erase/Program Protection bit 8(0x08020000~0x08023FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>OB_WP_N[15:8]</name>
        <displayName>OB_WP_N[15:8]</displayName>
        <addressOffset>0xB</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_WP_N[15:8]</name>
                <brief>WP complement value bit 15 to 8</brief>
                <description>WP complement value bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
	<OPByte>
        <name>OB_WP[23:16]</name>
        <displayName>OB_WP[23:16]</displayName>
        <addressOffset>0xC</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>OB_WP[23]</name>
                <brief>0x0805C000~0x0805FFFF</brief>
                <description>Page Erase/Program Protection bit 23(0x0805C000~0x0805FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[22]</name>
                <brief>0x08058000~0x0805BFFF</brief>
                <description>Page Erase/Program Protection bit 22(0x08058000~0x0805BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[21]</name>
                <brief>0x08054000~0x08057FFF</brief>
                <description>Page Erase/Program Protection bit 21(0x08054000~0x08057FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[20]</name>
                <brief>0x08050000~0x08053FFF</brief>
                <description>Page Erase/Program Protection bit 20(0x08050000~0x08053FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[19]</name>
                <brief>0x0804C000~0x0804FFFF</brief>
                <description>Page Erase/Program Protection bit 19(0x0804C000~0x0804FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[18]</name>
                <brief>0x08048000~0x0804BFFF</brief>
                <description>Page Erase/Program Protection bit 18(0x08048000~0x0804BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[17]</name>
                <brief>0x08044000~0x08047FFF</brief>
                <description>Page Erase/Program Protection bit 17(0x08044000~0x08047FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[16]</name>
                <brief>0x08040000~0x08043FFF</brief>
                <description>Page Erase/Program Protection bit 16(0x08040000~0x08043FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

