yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32E51x.xml
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_WP_N[23:16]</name>
        <displayName>OB_WP_N[23:16]</displayName>
        <addressOffset>0xD</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0xD</complement>
        <fields>
            <field>
                <name>OB_WP_N[23:16]</name>
                <brief>WP complement value bit 23 to 16</brief>
                <description>WP complement value bit 23 to 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
	<OPByte>
        <name>OB_WP[31:24]</name>
        <displayName>OB_WP[31:24]</displayName>
        <addressOffset>0xE</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>OB_WP[31]</name>                
				<brief>0x0807C000~0x0807FFFF</brief>
                <description>Page Erase/Program Protection bit 31(0x0807C000~0x0807FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[30]</name>
                <brief>0x08078000~0x0807BFFF</brief>
                <description>Page Erase/Program Protection bit 30(0x08078000~0x0807BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[29]</name>
                <brief>0x08074000~0x08077FFF</brief>
                <description>Page Erase/Program Protection bit 29(0x08074000~0x08077FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[28]</name>
                <brief>0x08070000~0x08073FFF</brief>
                <description>Page Erase/Program Protection bit 28(0x08070000~0x08073FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[27]</name>
                <brief>0x0806C000~0x0806FFFF</brief>
                <description>Page Erase/Program Protection bit 27(0x0806C000~0x0806FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[26]</name>
                <brief>0x08068000~0x0806BFFF</brief>
                <description>Page Erase/Program Protection bit 26(0x08068000~0x0806BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[25]</name>
                <brief>0x08064000~0x08067FFF</brief>
                <description>Page Erase/Program Protection bit 25(0x08064000~0x08067FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OB_WP[24]</name>
                <brief>0x08060000~0x08063FFF</brief>
                <description>Page Erase/Program Protection bit 24(0x08060000~0x08063FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>OB_WP_N[31:24]</name>
        <displayName>OB_WP_N[31:24]</displayName>
        <addressOffset>0xF</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_WP_N[31:24]</name>
                <brief>WP complement value bit 31 to 24</brief>
                <description>WP complement value bit 31 to 24</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
	<OPByte>
        <name>OB_USER1</name>
        <displayName>OB_USER1</displayName>
        <addressOffset>0x10</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>FLASH_ECCEN</name>
                <brief>FLASH_ECCEN</brief>
                <description>0: Disable ECC for Flash&#x000A;1: Enable ECC for Flash</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>SRAM_ECCEN</name>
                <brief>SRAM_ECCEN</brief>
				<description>0: disable SRAM ECC, and SRAM parity checking becomes available&#x000A;1: enable SRAM ECC</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>OB_USER1_N</name>
        <displayName>OB_USER1_N</displayName>
        <addressOffset>0x11</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>OB_USER1_N</name>
                <brief>OB_USER1 complement value</brief>
                <description>OB_USER1 complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    </OPBytes>
</OPBytesArchitecture>
<OTPBytesBlocks>
    <OTPBlocks baseAddress="0x1FFF7000" length="4096"/>
</OTPBytesBlocks>
<OTPBytes baseAddress="0x1FFF7000" length="4096">
    <OTPBlocks>
        <name>OTP</name>
		<displayName>OTP</displayName>
        <minProgrammeWidth>0x40</minProgrammeWidth>
		<maxProgrammeWidth>0x40</maxProgrammeWidth>
		<lockBaseAddress>0x0</lockBaseAddress>
		<BlockCnt>0x01</BlockCnt>
		<baseAddress>0x1FFF7000</baseAddress>
		<endAddress>0x1FFF7FFF</endAddress>
        <fields>
		   <field>
                <name>OTP_Block</name>
				<displayName>OTP_Block</displayName>
                <baseAddress>0x1FFF7000</baseAddress>
		        <endAddress>0x1FFF7FFF</endAddress>	
				<ifHasLockArea>0x0</ifHasLockArea>
				<size>0x1000</size>
				<lockOffset>0x00</lockOffset>
				<lockbitWidth>0</lockbitWidth>
				<LockVal>0</LockVal>
            </field>
        </fields>
    </OTPBlocks>
</OTPBytes>